#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
data.azurerm_subscription.sub: Reading...
data.azurerm_client_config.current: Reading...
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD0wNGIwNzc5NS04ZGRiLTQ2MWEtYmJlZS0wMmY5ZTFiZjdiNDY7b2JqZWN0SWQ9NDI5ZDZkZjAtZDY4My00N2JlLWFmY2EtN2Q1NDU1YzkwNDIwO3N1YnNjcmlwdGlvbklkPTc1OGQzNTI0LTg4ZWYtNGUwOS1iNGFhLTQ2Y2FhMDM1OTRlZjt0ZW5hbnRJZD00ZmU5MDBkOS1kYzQwLTQ1NTUtYjEyZC1kNWFkODZhZGJhNTU=]
data.azurerm_subscription.sub: Read complete after 0s [id=/subscriptions/758d3524-88ef-4e09-b4aa-46caa03594ef]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.ResourceGroup.azurerm_resource_group.test-resource-group will be created
  + resource "azurerm_resource_group" "test-resource-group" {
      + id       = (known after apply)
      + location = "westus"
      + name     = "RG-aharotest01-TF"
      + tags     = {
          + "Contact"     = "Andres Haro"
          + "Department"  = "CyberSecurity"
          + "Environment" = "Testing"
          + "Project"     = "Terraform"
          + "Support"     = "test@test.com"
        }
    }

  # module.StorageAccountContainer.azurerm_storage_container.az-storage-account-container will be created
  + resource "azurerm_storage_container" "az-storage-account-container" {
      + container_access_type             = "private"
      + default_encryption_scope          = (known after apply)
      + encryption_scope_override_enabled = true
      + has_immutability_policy           = (known after apply)
      + has_legal_hold                    = (known after apply)
      + id                                = (known after apply)
      + metadata                          = (known after apply)
      + name                              = "aharocontainer"
      + resource_manager_id               = (known after apply)
      + storage_account_id                = (known after apply)
    }

  # module.StorageAccounts.azurerm_storage_account.az-storage-account will be created
  + resource "azurerm_storage_account" "az-storage-account" {
      + access_tier                        = (known after apply)
      + account_kind                       = "StorageV2"
      + account_replication_type           = "GRS"
      + account_tier                       = "Standard"
      + allow_nested_items_to_be_public    = true
      + cross_tenant_replication_enabled   = false
      + default_to_oauth_authentication    = false
      + dns_endpoint_type                  = "Standard"
      + https_traffic_only_enabled         = true
      + id                                 = (known after apply)
      + infrastructure_encryption_enabled  = false
      + is_hns_enabled                     = false
      + large_file_share_enabled           = (known after apply)
      + local_user_enabled                 = true
      + location                           = "westus"
      + min_tls_version                    = "TLS1_2"
      + name                               = "staharostoragetf"
      + nfsv3_enabled                      = false
      + primary_access_key                 = (sensitive value)
      + primary_blob_connection_string     = (sensitive value)
      + primary_blob_endpoint              = (known after apply)
      + primary_blob_host                  = (known after apply)
      + primary_blob_internet_endpoint     = (known after apply)
      + primary_blob_internet_host         = (known after apply)
      + primary_blob_microsoft_endpoint    = (known after apply)
      + primary_blob_microsoft_host        = (known after apply)
      + primary_connection_string          = (sensitive value)
      + primary_dfs_endpoint               = (known after apply)
      + primary_dfs_host                   = (known after apply)
      + primary_dfs_internet_endpoint      = (known after apply)
      + primary_dfs_internet_host          = (known after apply)
      + primary_dfs_microsoft_endpoint     = (known after apply)
      + primary_dfs_microsoft_host         = (known after apply)
      + primary_file_endpoint              = (known after apply)
      + primary_file_host                  = (known after apply)
      + primary_file_internet_endpoint     = (known after apply)
      + primary_file_internet_host         = (known after apply)
      + primary_file_microsoft_endpoint    = (known after apply)
      + primary_file_microsoft_host        = (known after apply)
      + primary_location                   = (known after apply)
      + primary_queue_endpoint             = (known after apply)
      + primary_queue_host                 = (known after apply)
      + primary_queue_microsoft_endpoint   = (known after apply)
      + primary_queue_microsoft_host       = (known after apply)
      + primary_table_endpoint             = (known after apply)
      + primary_table_host                 = (known after apply)
      + primary_table_microsoft_endpoint   = (known after apply)
      + primary_table_microsoft_host       = (known after apply)
      + primary_web_endpoint               = (known after apply)
      + primary_web_host                   = (known after apply)
      + primary_web_internet_endpoint      = (known after apply)
      + primary_web_internet_host          = (known after apply)
      + primary_web_microsoft_endpoint     = (known after apply)
      + primary_web_microsoft_host         = (known after apply)
      + public_network_access_enabled      = false
      + queue_encryption_key_type          = "Service"
      + resource_group_name                = "RG-aharotest01-TF"
      + secondary_access_key               = (sensitive value)
      + secondary_blob_connection_string   = (sensitive value)
      + secondary_blob_endpoint            = (known after apply)
      + secondary_blob_host                = (known after apply)
      + secondary_blob_internet_endpoint   = (known after apply)
      + secondary_blob_internet_host       = (known after apply)
      + secondary_blob_microsoft_endpoint  = (known after apply)
      + secondary_blob_microsoft_host      = (known after apply)
      + secondary_connection_string        = (sensitive value)
      + secondary_dfs_endpoint             = (known after apply)
      + secondary_dfs_host                 = (known after apply)
      + secondary_dfs_internet_endpoint    = (known after apply)
      + secondary_dfs_internet_host        = (known after apply)
      + secondary_dfs_microsoft_endpoint   = (known after apply)
      + secondary_dfs_microsoft_host       = (known after apply)
      + secondary_file_endpoint            = (known after apply)
      + secondary_file_host                = (known after apply)
      + secondary_file_internet_endpoint   = (known after apply)
      + secondary_file_internet_host       = (known after apply)
      + secondary_file_microsoft_endpoint  = (known after apply)
      + secondary_file_microsoft_host      = (known after apply)
      + secondary_location                 = (known after apply)
      + secondary_queue_endpoint           = (known after apply)
      + secondary_queue_host               = (known after apply)
      + secondary_queue_microsoft_endpoint = (known after apply)
      + secondary_queue_microsoft_host     = (known after apply)
      + secondary_table_endpoint           = (known after apply)
      + secondary_table_host               = (known after apply)
      + secondary_table_microsoft_endpoint = (known after apply)
      + secondary_table_microsoft_host     = (known after apply)
      + secondary_web_endpoint             = (known after apply)
      + secondary_web_host                 = (known after apply)
      + secondary_web_internet_endpoint    = (known after apply)
      + secondary_web_internet_host        = (known after apply)
      + secondary_web_microsoft_endpoint   = (known after apply)
      + secondary_web_microsoft_host       = (known after apply)
      + sftp_enabled                       = false
      + shared_access_key_enabled          = true
      + table_encryption_key_type          = "Service"
      + tags                               = {
          + "Contact"     = "Andres Haro"
          + "Department"  = "CyberSecurity"
          + "Environment" = "Testing"
          + "Project"     = "Terraform"
          + "Support"     = "test@test.com"
        }

      + blob_properties (known after apply)

      + network_rules (known after apply)

      + queue_properties (known after apply)

      + routing (known after apply)

      + share_properties (known after apply)

      + static_website (known after apply)
    }

  # module.gh_federated_credential.azurerm_federated_identity_credential.cred will be created
  + resource "azurerm_federated_identity_credential" "cred" {
      + audience            = [
          + "api://AzureADTokenExchange",
        ]
      + id                  = (known after apply)
      + issuer              = "https://token.actions.githubusercontent.com"
      + name                = "hvaandres-azure-terraform-dev"
      + parent_id           = (known after apply)
      + resource_group_name = "RG-aharo-test01-identity"
      + subject             = "repo:hvaandres/azure-terraform:environment:dev"
    }

  # module.gh_federated_credential-pr.azurerm_federated_identity_credential.cred will be created
  + resource "azurerm_federated_identity_credential" "cred" {
      + audience            = [
          + "api://AzureADTokenExchange",
        ]
      + id                  = (known after apply)
      + issuer              = "https://token.actions.githubusercontent.com"
      + name                = "hvaandres-azure-terraform-pr"
      + parent_id           = (known after apply)
      + resource_group_name = "RG-aharo-test01-identity"
      + subject             = "repo:hvaandres/azure-terraform:pull_request"
    }

  # module.gh_usi.azurerm_user_assigned_identity.msi will be created
  + resource "azurerm_user_assigned_identity" "msi" {
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + location            = "westus"
      + name                = "aharo-identity"
      + principal_id        = (known after apply)
      + resource_group_name = "RG-aharo-test01-identity"
      + tags                = {
          + "Contact"     = "Alan Haro"
          + "Department"  = "CyberSecurity"
          + "Environment" = "Testing"
          + "Project"     = "Terraform"
          + "Support"     = "alan.haro@dev.com"
        }
      + tenant_id           = (known after apply)
    }

  # module.identity-resource-group.azurerm_resource_group.identity_rg_name will be created
  + resource "azurerm_resource_group" "identity_rg_name" {
      + id       = (known after apply)
      + location = "westus"
      + name     = "RG-aharo-test01-identity"
      + tags     = {
          + "Contact"     = "Alan Haro"
          + "Department"  = "CyberSecurity"
          + "Environment" = "Testing"
          + "Project"     = "Terraform"
          + "Support"     = "support@support.com"
        }
    }

  # module.sub_owner_role_assignment.azurerm_role_assignment.role will be created
  + resource "azurerm_role_assignment" "role" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Owner"
      + scope                            = "/subscriptions/758d3524-88ef-4e09-b4aa-46caa03594ef"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.tfstate_role_assignment.azurerm_role_assignment.role will be created
  + resource "azurerm_role_assignment" "role" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 9 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + federated_identity_credential_id    = (known after apply)
  + federated_identity_credential_pr_id = (known after apply)
  + identity_resource_group_name        = "RG-aharo-test01-identity"
  + resource_group_location             = "westus"
  + resource_group_name                 = "RG-aharotest01-TF"
  + storage_account_container_id        = (known after apply)
  + storage_account_id                  = (known after apply)
  + subscription_id                     = "/subscriptions/758d3524-88ef-4e09-b4aa-46caa03594ef"

Warning: Value for undeclared variable

The root module does not declare a variable named "base_name_rg" but a value
was found in file "./tfvars/terraform.tfvars". If you meant to use this
value, add a "variable" block to the configuration.

To silence these warnings, use TF_VAR_... environment variables to provide
certain "global" settings to all configurations in your organization. To
reduce the verbosity of these warnings, use the -compact-warnings option.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: main.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "main.tfplan"

```

</details>

*Pushed by: @hvaandres, Action: `pull_request`*